# GenericDepth Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..GenericDepth Property
ParameterTypeId Class See Also
---
"Depth"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId GenericDepth { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GenericDepth As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ GenericDepth {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace